resources/documents/manual.org

#+TITLE: Manual

#+OPTIONS: html-style:nil 
#+OPTIONS: html-scripts:nil
#+OPTIONS: title:nil
# #+OPTIONS: num:nil 

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./style.css" />
#+HTML_HEAD: <script defer src="./script.js"></script>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../style/color.css" />

* abs(x)
Returns the absolute value or vector length of x.

#+BEGIN_SRC 
X = (x,y,z)
abs(X)

┌            ┐1/2
│ 2    2    2│   
│x  + y  + z │   
│            │   
└            ┘   
#+END_SRC

* adj(m)
Returns the adjunct of matrix m. Adjunct is equal to determinant times inverse.

#+BEGIN_SRC 
A = ((a,b),(c,d))
adj(A) == det(A) inv(A)

1
#+END_SRC

* and(a,b,...)
Returns 1 if all arguments are true (nonzero). Returns 0 otherwise.

#+BEGIN_SRC 
and(1=1,2=2)

1
#+END_SRC

* arccos(x)
Returns the arc cosine of x.

#+BEGIN_SRC 
arccos(1/2)

 1   
╶─╴ π
 3   
#+END_SRC

* arccosh(x)

Returns the arc hyperbolic cosine of x.

* arcsin(x)

Returns the arc sine of x.

#+BEGIN_SRC 
arcsin(1/2)

 1   
╶─╴ π
 6   
#+END_SRC

* arcsinh(x)

Returns the arc hyperbolic sine of x.

* arctan(y,x)

Returns the arc tangent of y over x. If x is omitted then x = 1 is used.

#+BEGIN_SRC 
arctan(1,0)

 1   
╶─╴ π
 2   
#+END_SRC

* arctanh(x)

Returns the arc hyperbolic tangent of x.

* arg(z)

Returns the angle of complex z.

#+BEGIN_SRC 
arg(2 - 3i)
arctan(-3,2)
#+END_SRC

* binding(s)

The result of evaluating a symbol can differ from the symbol's binding. For example, the result may be expanded. The binding function returns the actual binding of a symbol.

#+BEGIN_SRC 
p = quote((x + 1)^2)
p
     2
p = x  + 2 x + 1
binding(p)
       2
(x + 1)
#+END_SRC

* ceiling(x)

Returns the smallest integer greater than or equal to x.

#+BEGIN_SRC 
ceiling(1/2)
1
#+END_SRC

* check(x)

If x is true (nonzero) then continue in a script, else stop. Expression x can include the relational operators ==, ===, <, <=, >, >=. Use the not function to test for inequality.

#+BEGIN_SRC 
A = 1
B = 1
check(A=B) 
-- script stops here if A not equal to B
#+END_SRC

* circexp(x)

Returns expression x with circular and hyperbolic functions converted to exponentials.

#+BEGIN_SRC 
circexp(cos(x) + i sin(x))
exp(i x)
#+END_SRC

* clear

Clears all symbol definitions.

* clock(z)

Returns complex z in polar form with base of negative 1 instead of e.

#+BEGIN_SRC 
clock(2 - 3i)
           arctan(−3,2) 
          ╶────────────╴
  1/2           π       
13    (−1)  
#+END_SRC
            
* cofactor(m,i,j)

Returns the cofactor of matrix m for row i and column j.

#+BEGIN_SRC 
A = ((a,b),(c,d))
cofactor(A,1,2) == adj(A)[2,1]
1
#+END_SRC

* conj(z)

Returns the complex conjugate of z.

#+BEGIN_SRC 
conj(2 - 3i)
2 + 3 i
#+END_SRC

* contract(a,i,j)

Returns tensor a summed over indices i and j. If i and j are omitted then 1 and 2 are used. The expression contract(m) computes the trace of matrix m.

#+BEGIN_SRC 
A = ((a,b),(c,d))
contract(A)
a + d
#+END_SRC

* cos(x)

Returns the cosine of x.

#+BEGIN_SRC 
cos(pi/4)
  1   
╶────╴
  1/2 
 2    
#+END_SRC

* cosh(x)

Returns the hyperbolic cosine of x.

#+BEGIN_SRC 
circexp(cosh(x))

 1             1        
╶─╴ exp(−x) + ╶─╴ exp(x)
 2             2        
#+END_SRC

