resources/documents/manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-07 vie 13:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="./style.css" />
<link rel="stylesheet" type="text/css" href="../../style/color.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org13f6541">1. abs(x)</a></li>
<li><a href="#org3251eda">2. adj(m)</a></li>
<li><a href="#orgfa0e80b">3. and(a,b,&#x2026;)</a></li>
<li><a href="#orgb6efade">4. arccos(x)</a></li>
<li><a href="#org6aff1cb">5. arccosh(x)</a></li>
<li><a href="#orgf33a632">6. arcsin(x)</a></li>
<li><a href="#orgcf928fa">7. arcsinh(x)</a></li>
<li><a href="#org76d7262">8. arctan(y,x)</a></li>
<li><a href="#org2044e03">9. arctanh(x)</a></li>
<li><a href="#org48f89c5">10. arg(z)</a></li>
<li><a href="#orga7bf6db">11. binding(s)</a></li>
<li><a href="#org3e4ae5c">12. ceiling(x)</a></li>
<li><a href="#orgec15c75">13. check(x)</a></li>
<li><a href="#org30a4745">14. circexp(x)</a></li>
<li><a href="#orgb26a0ab">15. clear</a></li>
<li><a href="#orgfe26f53">16. clock(z)</a></li>
<li><a href="#org7d25bac">17. cofactor(m,i,j)</a></li>
<li><a href="#org7d50b77">18. conj(z)</a></li>
<li><a href="#orga7275cb">19. contract(a,i,j)</a></li>
<li><a href="#orgce026c9">20. cos(x)</a></li>
<li><a href="#org3d94af2">21. cosh(x)</a></li>
<li><a href="#orgb6b816b">22. d(f,x)</a></li>
<li><a href="#org98c79f9">23. defint(f,x,a,b)</a></li>
<li><a href="#org97caf59">24. denominator(x)</a></li>
<li><a href="#org6b3d11e">25. det(m)</a></li>
<li><a href="#org1831444">26. dim(a,n)</a></li>
<li><a href="#orgd219f79">27. do(a,b,&#x2026;)</a></li>
<li><a href="#org8f1cb50">28. dot(a,b,&#x2026;)</a></li>
<li><a href="#org0af2cff">29. draw(f,x)</a></li>
<li><a href="#org4da1ef4">30. e</a></li>
<li><a href="#org1f55ced">31. eval(f,x,a)</a></li>
<li><a href="#org77bc2e8">32. exp(x)</a></li>
<li><a href="#orgd70de8b">33. expcos(z)</a></li>
<li><a href="#org5ee6da6">34. expcosh(z)</a></li>
<li><a href="#org25f06c0">35. expsin(z)</a></li>
<li><a href="#orgd3bd3d0">36. expsinh(z)</a></li>
<li><a href="#org88a86f9">37. exptan(z)</a></li>
<li><a href="#orgb6795b2">38. exptanh(z)</a></li>
<li><a href="#orgbaf6144">39. factorial(n)</a></li>
<li><a href="#orgae276ca">40. float(x)</a></li>
<li><a href="#orgede42a3">41. floor(x)</a></li>
<li><a href="#org01b51d8">42. for(i,j,k,a,b,&#x2026;)</a></li>
<li><a href="#orgb9bac06">43. hadamard(a,b,&#x2026;)</a></li>
<li><a href="#orga308b09">44. i</a></li>
<li><a href="#org57004c7">45. imag(z)</a></li>
<li><a href="#org1c8bc03">46. inner(a,b,&#x2026;)</a></li>
<li><a href="#org4060106">47. integral(f,x)</a></li>
<li><a href="#org149c3a9">48. inv(m)</a></li>
<li><a href="#org32a2c02">49. j</a></li>
<li><a href="#orgd6cbabb">50. kronecker(a,b,&#x2026;)</a></li>
<li><a href="#org66caff3">51. last</a></li>
<li><a href="#orgffbb231">52. log(x)</a></li>
<li><a href="#orgc796c2d">53. mag(z)</a></li>
<li><a href="#org035e7f9">54. minor(m,i,j)</a></li>
<li><a href="#orge0c0fbe">55. minormatrix(m,i,j)</a></li>
<li><a href="#orgf14a2bc">56. mod(a,b)</a></li>
<li><a href="#org1b395b1">57. noexpand(x)</a></li>
<li><a href="#orgb80137d">58. not(x)</a></li>
<li><a href="#org73a4a6b">59. numerator(x)</a></li>
<li><a href="#org55559e1">60. or(a,b,&#x2026;)</a></li>
<li><a href="#org59b1166">61. outer(a,b,&#x2026;)</a></li>
<li><a href="#orgba5040e">62. pi</a></li>
<li><a href="#org4b737ca">63. polar(z)</a></li>
<li><a href="#orgeebfc51">64. power</a></li>
<li><a href="#org4ccbef6">65. print(a,b,&#x2026;)</a></li>
<li><a href="#org5ec440f">66. product(i,j,k,f)</a></li>
<li><a href="#orgc463032">67. product(y)</a></li>
<li><a href="#org81307f6">68. quote(x)</a></li>
<li><a href="#org189b5f5">69. rank(a)</a></li>
<li><a href="#org9025860">70. rationalize(x)</a></li>
<li><a href="#org7f13e9d">71. real(z)</a></li>
<li><a href="#orgdc27b82">72. rect(z)</a></li>
<li><a href="#org73ef6f2">73. rotate(u,s,k,&#x2026;)</a></li>
<li><a href="#orgfc190b9">74. simplify(x)</a></li>
<li><a href="#org0b6d73c">75. sin(x)</a></li>
<li><a href="#org3d166e0">76. sinh(x)</a></li>
<li><a href="#org7939c99">77. sqrt(x)</a></li>
<li><a href="#orgff2ece9">78. stop</a></li>
<li><a href="#org055654d">79. sum(i,j,k,f)</a></li>
<li><a href="#orgeb4a426">80. sum(y)</a></li>
<li><a href="#orge713a70">81. tan(x)</a></li>
<li><a href="#orge173206">82. tanh(x)</a></li>
<li><a href="#orga979e5f">83. test(a,b,c,d,&#x2026;)</a></li>
<li><a href="#orga8407b8">84. trace</a></li>
<li><a href="#org666733f">85. transpose(a,i,j)</a></li>
<li><a href="#org09a7d8b">86. unit(n)</a></li>
<li><a href="#org79411b5">87. zero(i,j,&#x2026;)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org13f6541" class="outline-2">
<h2 id="org13f6541"><span class="section-number-2">1</span> abs(x)</h2>
<div class="outline-text-2" id="text-1">
<p>
Returns the absolute value or vector length of x.
</p>

<pre class="example">
X = (x,y,z)
abs(X)

┌            ┐1/2
│ 2    2    2│   
│x  + y  + z │   
│            │   
└            ┘   
</pre>
</div>
</div>

<div id="outline-container-org3251eda" class="outline-2">
<h2 id="org3251eda"><span class="section-number-2">2</span> adj(m)</h2>
<div class="outline-text-2" id="text-2">
<p>
Returns the adjunct of matrix m. Adjunct is equal to determinant times inverse.
</p>

<pre class="example">
A = ((a,b),(c,d))
adj(A) == det(A) inv(A)

1
</pre>
</div>
</div>

<div id="outline-container-orgfa0e80b" class="outline-2">
<h2 id="orgfa0e80b"><span class="section-number-2">3</span> and(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-3">
<p>
Returns 1 if all arguments are true (nonzero). Returns 0 otherwise.
</p>

<pre class="example">
and(1=1,2=2)

1
</pre>
</div>
</div>

<div id="outline-container-orgb6efade" class="outline-2">
<h2 id="orgb6efade"><span class="section-number-2">4</span> arccos(x)</h2>
<div class="outline-text-2" id="text-4">
<p>
Returns the arc cosine of x.
</p>

<pre class="example">
arccos(1/2)

 1   
╶─╴ π
 3   
</pre>
</div>
</div>

<div id="outline-container-org6aff1cb" class="outline-2">
<h2 id="org6aff1cb"><span class="section-number-2">5</span> arccosh(x)</h2>
<div class="outline-text-2" id="text-5">
<p>
Returns the arc hyperbolic cosine of x.
</p>
</div>
</div>

<div id="outline-container-orgf33a632" class="outline-2">
<h2 id="orgf33a632"><span class="section-number-2">6</span> arcsin(x)</h2>
<div class="outline-text-2" id="text-6">
<p>
Returns the arc sine of x.
</p>

<pre class="example">
arcsin(1/2)

 1   
╶─╴ π
 6   
</pre>
</div>
</div>

<div id="outline-container-orgcf928fa" class="outline-2">
<h2 id="orgcf928fa"><span class="section-number-2">7</span> arcsinh(x)</h2>
<div class="outline-text-2" id="text-7">
<p>
Returns the arc hyperbolic sine of x.
</p>
</div>
</div>

<div id="outline-container-org76d7262" class="outline-2">
<h2 id="org76d7262"><span class="section-number-2">8</span> arctan(y,x)</h2>
<div class="outline-text-2" id="text-8">
<p>
Returns the arc tangent of y over x. If x is omitted then x = 1 is used.
</p>

<pre class="example">
arctan(1,0)

 1   
╶─╴ π
 2   
</pre>
</div>
</div>

<div id="outline-container-org2044e03" class="outline-2">
<h2 id="org2044e03"><span class="section-number-2">9</span> arctanh(x)</h2>
<div class="outline-text-2" id="text-9">
<p>
Returns the arc hyperbolic tangent of x.
</p>
</div>
</div>

<div id="outline-container-org48f89c5" class="outline-2">
<h2 id="org48f89c5"><span class="section-number-2">10</span> arg(z)</h2>
<div class="outline-text-2" id="text-10">
<p>
Returns the angle of complex z.
</p>

<pre class="example">
arg(2 - 3i)
arctan(-3,2)
</pre>
</div>
</div>

<div id="outline-container-orga7bf6db" class="outline-2">
<h2 id="orga7bf6db"><span class="section-number-2">11</span> binding(s)</h2>
<div class="outline-text-2" id="text-11">
<p>
The result of evaluating a symbol can differ from the symbol's binding. For example, the result may be expanded. The binding function returns the actual binding of a symbol.
</p>

<pre class="example">
p = quote((x + 1)^2)
p
     2
p = x  + 2 x + 1
binding(p)
       2
(x + 1)
</pre>
</div>
</div>

<div id="outline-container-org3e4ae5c" class="outline-2">
<h2 id="org3e4ae5c"><span class="section-number-2">12</span> ceiling(x)</h2>
<div class="outline-text-2" id="text-12">
<p>
Returns the smallest integer greater than or equal to x.
</p>

<pre class="example">
ceiling(1/2)
1
</pre>
</div>
</div>

<div id="outline-container-orgec15c75" class="outline-2">
<h2 id="orgec15c75"><span class="section-number-2">13</span> check(x)</h2>
<div class="outline-text-2" id="text-13">
<p>
If x is true (nonzero) then continue in a script, else stop. Expression x can include the relational operators <code>=, ==</code>, &lt;, &lt;=, &gt;, &gt;=. Use the not function to test for inequality.
</p>

<pre class="example">
A = 1
B = 1
check(A=B) 
-- script stops here if A not equal to B
</pre>
</div>
</div>

<div id="outline-container-org30a4745" class="outline-2">
<h2 id="org30a4745"><span class="section-number-2">14</span> circexp(x)</h2>
<div class="outline-text-2" id="text-14">
<p>
Returns expression x with circular and hyperbolic functions converted to exponentials.
</p>

<pre class="example">
circexp(cos(x) + i sin(x))
exp(i x)
</pre>
</div>
</div>

<div id="outline-container-orgb26a0ab" class="outline-2">
<h2 id="orgb26a0ab"><span class="section-number-2">15</span> clear</h2>
<div class="outline-text-2" id="text-15">
<p>
Clears all symbol definitions.
</p>
</div>
</div>

<div id="outline-container-orgfe26f53" class="outline-2">
<h2 id="orgfe26f53"><span class="section-number-2">16</span> clock(z)</h2>
<div class="outline-text-2" id="text-16">
<p>
Returns complex z in polar form with base of negative 1 instead of e.
</p>

<pre class="example">
clock(2 - 3i)
           arctan(−3,2) 
          ╶────────────╴
  1/2           π       
13    (−1)  
</pre>
</div>
</div>

<div id="outline-container-org7d25bac" class="outline-2">
<h2 id="org7d25bac"><span class="section-number-2">17</span> cofactor(m,i,j)</h2>
<div class="outline-text-2" id="text-17">
<p>
Returns the cofactor of matrix m for row i and column j.
</p>

<pre class="example">
A = ((a,b),(c,d))
cofactor(A,1,2) == adj(A)[2,1]
1
</pre>
</div>
</div>

<div id="outline-container-org7d50b77" class="outline-2">
<h2 id="org7d50b77"><span class="section-number-2">18</span> conj(z)</h2>
<div class="outline-text-2" id="text-18">
<p>
Returns the complex conjugate of z.
</p>

<pre class="example">
conj(2 - 3i)
2 + 3 i
</pre>
</div>
</div>

<div id="outline-container-orga7275cb" class="outline-2">
<h2 id="orga7275cb"><span class="section-number-2">19</span> contract(a,i,j)</h2>
<div class="outline-text-2" id="text-19">
<p>
Returns tensor a summed over indices i and j. If i and j are omitted then 1 and 2 are used. The expression contract(m) computes the trace of matrix m.
</p>

<pre class="example">
A = ((a,b),(c,d))
contract(A)
a + d
</pre>
</div>
</div>

<div id="outline-container-orgce026c9" class="outline-2">
<h2 id="orgce026c9"><span class="section-number-2">20</span> cos(x)</h2>
<div class="outline-text-2" id="text-20">
<p>
Returns the cosine of x.
</p>

<pre class="example">
cos(pi/4)
  1   
╶────╴
  1/2 
 2    
</pre>
</div>
</div>
