resources/documents/manual.org
* d(f,x)

Returns the partial derivative of f with respect to x.

#+BEGIN_SRC 
d(x^2,x)
2 x
#+END_SRC

Argument f can be a tensor of any rank. Argument x can be a vector. When x is a vector the result is the gradient of f.

#+BEGIN_SRC 
F = (f(),g(),h())
X = (x,y,z)
d(F,X)

┌                                ┐
│ d(f(),x)   d(f(),y)   d(f(),z) │
│                                │
│ d(g(),x)   d(g(),y)   d(g(),z) │
│                                │
│ d(h(),x)   d(h(),y)   d(h(),z) │
└                                ┘
#+END_SRC

It is OK to use d as a variable name. It will not conflict with function d.

It is OK to redefine d as a different function. The function derivative, a synonym for d, can still be used to obtain a partial derivative.

* defint(f,x,a,b)

Returns the definite integral of f with respect to x evaluated from a to b. The argument list can be extended for multiple integrals. For example, defint(f,x,a,b,y,c,d) is equivalent to defint(defint(f,x,a,b),y,c,d).

#+BEGIN_SRC 
f = (1 + cos(theta)^2) sin(theta)

defint(f, theta, 0, pi, phi, 0, 2pi)

 16   
╶──╴ π
 3    
#+END_SRC

* denominator(x)

Returns the denominator of expression x.

#+BEGIN_SRC 
denominator(a/b)
b
#+END_SRC

* det(m)

Returns the determinant of matrix m.

#+BEGIN_SRC 
A = ((a,b),(c,d))
det(A)
a d - b c
#+END_SRC

* dim(a,n)

Returns the dimension of the nth index of tensor a. Index numbering starts with 1.

#+BEGIN_SRC 
A = ((1,2),(3,4),(5,6))
dim(A,1)
3
#+END_SRC

* do(a,b,...)

Evaluates each argument from left to right. Returns the result of the final argument.

#+BEGIN_SRC 
do(A=1,B=2,A+B)
3
#+END_SRC

* dot(a,b,...)

Returns the dot product of vectors, matrices, and tensors. Also known as the matrix product.

#+BEGIN_SRC 
-- solve for X in AX=B
A = ((1,2),(3,4))
B = (5,6)
X = dot(inv(A),B)
X
    ┌     ┐
    │ −4  │
    │     │
X = │  9  │
    │ ╶─╴ │
    │  2  │
    └     ┘
#+END_SRC

* draw(f,x)

Draws a graph of f(x). Drawing ranges can be set with xrange and yrange.

#+BEGIN_SRC 
xrange = (0,1)
yrange = (0,1)
draw(x^2,x)
#+END_SRC

* e

Symbol e is initialized to the natural number e.

#+BEGIN_SRC 
e^x
exp(x)
#+END_SRC

Note: It is OK to clear or redefine e and use the symbol for something else.

* eval(f,x,a)

Returns expression f evaluated at x equals a. The argument list can be extended for multivariate expressions. For example, eval(f,x,a,y,b) is equivalent to eval(eval(f,x,a),y,b).

#+BEGIN_SRC 
eval(x + y,x,a,y,b)
a + b
#+END_SRC

* exp(x)
Returns the exponential of x.

#+BEGIN_SRC 
exp(i pi)
-1
#+END_SRC

* expcos(z)
Returns the cosine of z in exponential form.

#+BEGIN_SRC 
expcos(z)

 1              1           
╶─╴ exp(i z) + ╶─╴ exp(−i z)
 2              2           
#+END_SRC

* expcosh(z)
Returns the hyperbolic cosine of z in exponential form.

#+BEGIN_SRC 
expcosh(z)

 1             1        
╶─╴ exp(−z) + ╶─╴ exp(z)
 2             2        
#+END_SRC

* expsin(z)
Returns the sine of z in exponential form.

#+BEGIN_SRC 
expsin(z)

  1                1             
−╶─╴ i exp(i z) + ╶─╴ i exp(−i z)
  2                2             
#+END_SRC

* expsinh(z)
Returns the hyperbolic sine of z in exponential form.

#+BEGIN_SRC 
expsinh(z)

  1             1        
−╶─╴ exp(−z) + ╶─╴ exp(z)
  2             2        
#+END_SRC

* exptan(z)
Returns the tangent of z in exponential form.

#+BEGIN_SRC 
exptan(z)

       i             i exp(2 i z)  
╶──────────────╴ − ╶──────────────╴
 exp(2 i z) + 1     exp(2 i z) + 1 
#+END_SRC

* exptanh(z)
Returns the hyperbolic tangent of z in exponential form.

#+BEGIN_SRC 
exptanh(z)

       1             exp(2 z)   
−╶────────────╴ + ╶────────────╴
  exp(2 z) + 1     exp(2 z) + 1 
#+END_SRC

* factorial(n)
Returns the factorial of n. The expression n! can also be used.

#+BEGIN_SRC 
20!
2432902008176640000
#+END_SRC

* float(x)
Returns expression x with rational numbers and integers converted to floating point values. The symbol pi and the natural number are also converted.

#+BEGIN_SRC 
float(212^17)
          39
3.52947 10
#+END_SRC

* floor(x)
Returns the largest integer less than or equal to x.

#+BEGIN_SRC 
floor(1/2)
0
#+END_SRC

* for(i,j,k,a,b,...)

For i equals j through k evaluate a, b, etc.

#+BEGIN_SRC 
for(k,1,3,A=k,print(A))
A = 1
A = 2
A = 3
#+END_SRC

Note: The original value of i is restored after for completes. If symbol i is used for index variable i then the imaginary unit is overridden in the scope of for.

* hadamard(a,b,...)

Returns the Hadamard (element-wise) product. The arguments are required to have the same dimensions. The Hadamard product is also accomplished by simply multiplying the arguments.

#+BEGIN_SRC 
A = ((A11,A12),(A21,A22))
B = ((B11,B12),(B21,B22))
A B

┌                   ┐
│ A   B     A   B   │
│  11  11    12  12 │
│                   │
│ A   B     A   B   │
│  21  21    22  22 │
└                   ┘
#+END_SRC

* i
Symbol i is initialized to the imaginary unit (−1)1/2.

#+BEGIN_SRC 
exp(i pi)
-1
#+END_SRC

Note: It is OK to clear or redefine i and use the symbol for something else.

* imag(z)
Returns the imaginary part of complex z.

#+BEGIN_SRC 
imag(2 - 3i)
-3
#+END_SRC

