resources/documents/manual.html

<div id="outline-container-org3d94af2" class="outline-2">
<h2 id="org3d94af2"><span class="section-number-2">21</span> cosh(x)</h2>
<div class="outline-text-2" id="text-21">
<p>
Returns the hyperbolic cosine of x.
</p>

<pre class="example">
circexp(cosh(x))

 1             1        
╶─╴ exp(−x) + ╶─╴ exp(x)
 2             2        
</pre>
</div>
</div>

<div id="outline-container-orgb6b816b" class="outline-2">
<h2 id="orgb6b816b"><span class="section-number-2">22</span> d(f,x)</h2>
<div class="outline-text-2" id="text-22">
<p>
Returns the partial derivative of f with respect to x.
</p>

<pre class="example">
d(x^2,x)
2 x
</pre>

<p>
Argument f can be a tensor of any rank. Argument x can be a vector. When x is a vector the result is the gradient of f.
</p>

<pre class="example">
F = (f(),g(),h())
X = (x,y,z)
d(F,X)

┌                                ┐
│ d(f(),x)   d(f(),y)   d(f(),z) │
│                                │
│ d(g(),x)   d(g(),y)   d(g(),z) │
│                                │
│ d(h(),x)   d(h(),y)   d(h(),z) │
└                                ┘
</pre>

<p>
It is OK to use d as a variable name. It will not conflict with function d.
</p>

<p>
It is OK to redefine d as a different function. The function derivative, a synonym for d, can still be used to obtain a partial derivative.
</p>
</div>
</div>

<div id="outline-container-org98c79f9" class="outline-2">
<h2 id="org98c79f9"><span class="section-number-2">23</span> defint(f,x,a,b)</h2>
<div class="outline-text-2" id="text-23">
<p>
Returns the definite integral of f with respect to x evaluated from a to b. The argument list can be extended for multiple integrals. For example, defint(f,x,a,b,y,c,d) is equivalent to defint(defint(f,x,a,b),y,c,d).
</p>

<pre class="example">
f = (1 + cos(theta)^2) sin(theta)

defint(f, theta, 0, pi, phi, 0, 2pi)

 16   
╶──╴ π
 3    
</pre>
</div>
</div>

<div id="outline-container-org97caf59" class="outline-2">
<h2 id="org97caf59"><span class="section-number-2">24</span> denominator(x)</h2>
<div class="outline-text-2" id="text-24">
<p>
Returns the denominator of expression x.
</p>

<pre class="example">
denominator(a/b)
b
</pre>
</div>
</div>

<div id="outline-container-org6b3d11e" class="outline-2">
<h2 id="org6b3d11e"><span class="section-number-2">25</span> det(m)</h2>
<div class="outline-text-2" id="text-25">
<p>
Returns the determinant of matrix m.
</p>

<pre class="example">
A = ((a,b),(c,d))
det(A)
a d - b c
</pre>
</div>
</div>

<div id="outline-container-org1831444" class="outline-2">
<h2 id="org1831444"><span class="section-number-2">26</span> dim(a,n)</h2>
<div class="outline-text-2" id="text-26">
<p>
Returns the dimension of the nth index of tensor a. Index numbering starts with 1.
</p>

<pre class="example">
A = ((1,2),(3,4),(5,6))
dim(A,1)
3
</pre>
</div>
</div>

<div id="outline-container-orgd219f79" class="outline-2">
<h2 id="orgd219f79"><span class="section-number-2">27</span> do(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-27">
<p>
Evaluates each argument from left to right. Returns the result of the final argument.
</p>

<pre class="example">
do(A=1,B=2,A+B)
3
</pre>
</div>
</div>

<div id="outline-container-org8f1cb50" class="outline-2">
<h2 id="org8f1cb50"><span class="section-number-2">28</span> dot(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-28">
<p>
Returns the dot product of vectors, matrices, and tensors. Also known as the matrix product.
</p>

<pre class="example">
-- solve for X in AX=B
A = ((1,2),(3,4))
B = (5,6)
X = dot(inv(A),B)
X
    ┌     ┐
    │ −4  │
    │     │
X = │  9  │
    │ ╶─╴ │
    │  2  │
    └     ┘
</pre>
</div>
</div>

<div id="outline-container-org0af2cff" class="outline-2">
<h2 id="org0af2cff"><span class="section-number-2">29</span> draw(f,x)</h2>
<div class="outline-text-2" id="text-29">
<p>
Draws a graph of f(x). Drawing ranges can be set with xrange and yrange.
</p>

<pre class="example">
xrange = (0,1)
yrange = (0,1)
draw(x^2,x)
</pre>
</div>
</div>

<div id="outline-container-org4da1ef4" class="outline-2">
<h2 id="org4da1ef4"><span class="section-number-2">30</span> e</h2>
<div class="outline-text-2" id="text-30">
<p>
Symbol e is initialized to the natural number e.
</p>

<pre class="example">
e^x
exp(x)
</pre>

<p>
Note: It is OK to clear or redefine e and use the symbol for something else.
</p>
</div>
</div>

<div id="outline-container-org1f55ced" class="outline-2">
<h2 id="org1f55ced"><span class="section-number-2">31</span> eval(f,x,a)</h2>
<div class="outline-text-2" id="text-31">
<p>
Returns expression f evaluated at x equals a. The argument list can be extended for multivariate expressions. For example, eval(f,x,a,y,b) is equivalent to eval(eval(f,x,a),y,b).
</p>

<pre class="example">
eval(x + y,x,a,y,b)
a + b
</pre>
</div>
</div>

<div id="outline-container-org77bc2e8" class="outline-2">
<h2 id="org77bc2e8"><span class="section-number-2">32</span> exp(x)</h2>
<div class="outline-text-2" id="text-32">
<p>
Returns the exponential of x.
</p>

<pre class="example">
exp(i pi)
-1
</pre>
</div>
</div>

<div id="outline-container-orgd70de8b" class="outline-2">
<h2 id="orgd70de8b"><span class="section-number-2">33</span> expcos(z)</h2>
<div class="outline-text-2" id="text-33">
<p>
Returns the cosine of z in exponential form.
</p>

<pre class="example">
expcos(z)

 1              1           
╶─╴ exp(i z) + ╶─╴ exp(−i z)
 2              2           
</pre>
</div>
</div>

<div id="outline-container-org5ee6da6" class="outline-2">
<h2 id="org5ee6da6"><span class="section-number-2">34</span> expcosh(z)</h2>
<div class="outline-text-2" id="text-34">
<p>
Returns the hyperbolic cosine of z in exponential form.
</p>

<pre class="example">
expcosh(z)

 1             1        
╶─╴ exp(−z) + ╶─╴ exp(z)
 2             2        
</pre>
</div>
</div>

<div id="outline-container-org25f06c0" class="outline-2">
<h2 id="org25f06c0"><span class="section-number-2">35</span> expsin(z)</h2>
<div class="outline-text-2" id="text-35">
<p>
Returns the sine of z in exponential form.
</p>

<pre class="example">
expsin(z)

  1                1             
−╶─╴ i exp(i z) + ╶─╴ i exp(−i z)
  2                2             
</pre>
</div>
</div>

<div id="outline-container-orgd3bd3d0" class="outline-2">
<h2 id="orgd3bd3d0"><span class="section-number-2">36</span> expsinh(z)</h2>
<div class="outline-text-2" id="text-36">
<p>
Returns the hyperbolic sine of z in exponential form.
</p>

<pre class="example">
expsinh(z)

  1             1        
−╶─╴ exp(−z) + ╶─╴ exp(z)
  2             2        
</pre>
</div>
</div>

<div id="outline-container-org88a86f9" class="outline-2">
<h2 id="org88a86f9"><span class="section-number-2">37</span> exptan(z)</h2>
<div class="outline-text-2" id="text-37">
<p>
Returns the tangent of z in exponential form.
</p>

<pre class="example">
exptan(z)

       i             i exp(2 i z)  
╶──────────────╴ − ╶──────────────╴
 exp(2 i z) + 1     exp(2 i z) + 1 
</pre>
</div>
</div>

<div id="outline-container-orgb6795b2" class="outline-2">
<h2 id="orgb6795b2"><span class="section-number-2">38</span> exptanh(z)</h2>
<div class="outline-text-2" id="text-38">
<p>
Returns the hyperbolic tangent of z in exponential form.
</p>

<pre class="example">
exptanh(z)

       1             exp(2 z)   
−╶────────────╴ + ╶────────────╴
  exp(2 z) + 1     exp(2 z) + 1 
</pre>
</div>
</div>

<div id="outline-container-orgbaf6144" class="outline-2">
<h2 id="orgbaf6144"><span class="section-number-2">39</span> factorial(n)</h2>
<div class="outline-text-2" id="text-39">
<p>
Returns the factorial of n. The expression n! can also be used.
</p>

<pre class="example">
20!
2432902008176640000
</pre>
</div>
</div>

<div id="outline-container-orgae276ca" class="outline-2">
<h2 id="orgae276ca"><span class="section-number-2">40</span> float(x)</h2>
<div class="outline-text-2" id="text-40">
<p>
Returns expression x with rational numbers and integers converted to floating point values. The symbol pi and the natural number are also converted.
</p>

<pre class="example">
float(212^17)
          39
3.52947 10
</pre>
</div>
</div>

<div id="outline-container-orgede42a3" class="outline-2">
<h2 id="orgede42a3"><span class="section-number-2">41</span> floor(x)</h2>
<div class="outline-text-2" id="text-41">
<p>
Returns the largest integer less than or equal to x.
</p>

<pre class="example">
floor(1/2)
0
</pre>
</div>
</div>

<div id="outline-container-org01b51d8" class="outline-2">
<h2 id="org01b51d8"><span class="section-number-2">42</span> for(i,j,k,a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-42">
<p>
For i equals j through k evaluate a, b, etc.
</p>

<pre class="example">
for(k,1,3,A=k,print(A))
A = 1
A = 2
A = 3
</pre>

<p>
Note: The original value of i is restored after for completes. If symbol i is used for index variable i then the imaginary unit is overridden in the scope of for.
</p>
</div>
</div>

<div id="outline-container-orgb9bac06" class="outline-2">
<h2 id="orgb9bac06"><span class="section-number-2">43</span> hadamard(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-43">
<p>
Returns the Hadamard (element-wise) product. The arguments are required to have the same dimensions. The Hadamard product is also accomplished by simply multiplying the arguments.
</p>

<pre class="example">
A = ((A11,A12),(A21,A22))
B = ((B11,B12),(B21,B22))
A B

┌                   ┐
│ A   B     A   B   │
│  11  11    12  12 │
│                   │
│ A   B     A   B   │
│  21  21    22  22 │
└                   ┘
</pre>
</div>
</div>

<div id="outline-container-orga308b09" class="outline-2">
<h2 id="orga308b09"><span class="section-number-2">44</span> i</h2>
<div class="outline-text-2" id="text-44">
<p>
Symbol i is initialized to the imaginary unit (−1)1/2.
</p>

<pre class="example">
exp(i pi)
-1
</pre>

<p>
Note: It is OK to clear or redefine i and use the symbol for something else.
</p>
</div>
</div>

<div id="outline-container-org57004c7" class="outline-2">
<h2 id="org57004c7"><span class="section-number-2">45</span> imag(z)</h2>
<div class="outline-text-2" id="text-45">
<p>
Returns the imaginary part of complex z.
</p>

<pre class="example">
imag(2 - 3i)
-3
</pre>
</div>
</div>
