resources/documents/manual.org
* inner(a,b,...)
Returns the inner product of vectors, matrices, and tensors. Also known as the matrix product.

#+BEGIN_SRC 
A = ((a,b),(c,d))
B = (x,y)
inner(A,B)

┌           ┐
│ a x + b y │
│           │
│ c x + d y │
└           ┘
#+END_SRC

Note: inner and dot are the same function.

* integral(f,x)

Returns the integral of f with respect to x.

#+BEGIN_SRC 
integral(x^2,x)

 1   3
╶─╴ x 
 3    
#+END_SRC

* inv(m)
Returns the inverse of matrix m.

#+BEGIN_SRC 
A = ((1,2),(3,4))
inv(A)

┌            ┐
│ −2     1   │
│            │
│  3      1  │
│ ╶─╴   −╶─╴ │
│  2      2  │
└            ┘
#+END_SRC

* j

Set j=sqrt(-1) to use j for the imaginary unit instead of i.

#+BEGIN_SRC 
j = sqrt(-1)
1/sqrt(-1)
-j
#+END_SRC

* kronecker(a,b,...)

Returns the Kronecker product of vectors and matrices.

#+BEGIN_SRC 
A = ((1,2),(3,4))
B = ((a,b),(c,d))
kronecker(A,B)
┌                       ┐
│  a     b    2 a   2 b │
│                       │
│  c     d    2 c   2 d │
│                       │
│ 3 a   3 b   4 a   4 b │
│                       │
│ 3 c   3 d   4 c   4 d │
└                       ┘
#+END_SRC

* last

The result of the previous calculation is stored in last.

#+BEGIN_SRC 
212^17
3529471145760275132301897342055866171392
last^(1/17)
212
#+END_SRC

Note: Symbol last is an implied argument when a function has no argument list.

#+BEGIN_SRC 
212^17
3529471145760275132301897342055866171392
float
          39
3.52947 10
#+END_SRC

* log(x)

Returns the natural logarithm of x.

#+BEGIN_SRC 
log(x^y)
y log(x)
#+END_SRC

* mag(z)

Returns the magnitude of complex z.

#+BEGIN_SRC 
mag(x + i y)

┌       ┐1/2
│ 2    2│   
│x  + y │   
│       │   
└       ┘   
#+END_SRC

* minor(m,i,j)

Returns the minor of matrix m for row i and column j.

#+BEGIN_SRC 
A = ((1,2,3),(4,5,6),(7,8,9))
minor(A,1,1) == det(minormatrix(A,1,1))
1
#+END_SRC

* minormatrix(m,i,j)

Returns a copy of matrix m with row i and column j removed.

#+BEGIN_SRC 
A = ((1,2,3),(4,5,6),(7,8,9))
minormatrix(A,1,1)

┌       ┐
│ 5   6 │
│       │
│ 8   9 │
└       ┘
#+END_SRC


* mod(a,b)

Returns the remainder of a over b.

#+BEGIN_SRC 
mod(5,3/8)
 1 
╶─╴
 8 
#+END_SRC

* noexpand(x)

Evaluates expression x without expanding products of sums.

#+BEGIN_SRC 
noexpand((x + 1)^2 / (x + 1))
x + 1
#+END_SRC

* not(x)

Returns 0 if x is true (nonzero). Returns 1 otherwise.

#+BEGIN_SRC 
not(1=1)
0
#+END_SRC

* numerator(x)

Returns the numerator of expression x.

#+BEGIN_SRC 
numerator(a/b)
a
#+END_SRC

* or(a,b,...)

Returns 1 if at least one argument is true (nonzero). Returns 0 otherwise.

#+BEGIN_SRC 
or(1=1,2=2)
1
#+END_SRC

* outer(a,b,...)

Returns the outer product of vectors, matrices, and tensors.

#+BEGIN_SRC 
A = (a,b,c)
B = (x,y,z)
outer(A,B)
┌                 ┐
│ a x   a y   a z │
│                 │
│ b x   b y   b z │
│                 │
│ c x   c y   c z │
└                 ┘
#+END_SRC

* pi

Symbol for π.

#+BEGIN_SRC 
exp(i pi)
-1
#+END_SRC

* polar(z)

Returns complex z in polar form.

#+BEGIN_SRC 
polar(x - i y)

┌       ┐1/2                    
│ 2    2│                       
│x  + y │    exp(i arctan(−y,x))
│       │                       
└       ┘                       
#+END_SRC

* power

Use ^ to raise something to a power. Use parentheses for negative powers.

#+BEGIN_SRC 
x^(-1/2)

  1   
╶────╴
  1/2 
 x    
#+END_SRC

* print(a,b,...)

Evaluate expressions and print the results. Useful for printing from inside a for loop.

#+BEGIN_SRC 
for(j,1,3,print(j))
j = 1
j = 2
j = 3
#+END_SRC

* product(i,j,k,f)

For i equals j through k evaluate f. Returns the product of all f.

#+BEGIN_SRC 
product(j,1,3,x + j)

 3      2
x  + 6 x  + 11 x + 6
#+END_SRC

The original value of i is restored after product completes. If symbol i is used for index variable i then the imaginary unit is overridden in the scope of product.

* product(y)

Returns the product of components of y.

#+BEGIN_SRC 
product((1,2,3,4))
24
#+END_SRC

* quote(x)

Returns expression x without evaluating it first.

#+BEGIN_SRC 
quote((x + 1)^2)
       2
(x + 1)
#+END_SRC

* rank(a)

Returns the number of indices that tensor a has.

#+BEGIN_SRC 
A = ((a,b),(c,d))
rank(A)
2
#+END_SRC

* rationalize(x)

Returns expression x with everything over a common denominator.

#+BEGIN_SRC 
rationalize(1/a + 1/b + 1/2)

 2 a + a b + 2 b 
╶───────────────╴
      2 a b      
#+END_SRC

Note: rationalize returns an unexpanded expression. If the result is assigned to a symbol, evaluating the symbol will expand the result. Use binding to retrieve the unexpanded expression.

#+BEGIN_SRC 
f = rationalize(1/a + 1/b + 1/2)
binding(f)

 2 a + a b + 2 b 
╶───────────────╴
      2 a b      
#+END_SRC

* real(z)

Returns the real part of complex z.

#+BEGIN_SRC 
real(2 - 3i)
2
#+END_SRC

* rect(z)

Returns complex z in rectangular form.

#+BEGIN_SRC 
rect(exp(i x))
cos(x) + i sin(x)
#+END_SRC

