resources/documents/manual.html

<div id="outline-container-org1c8bc03" class="outline-2">
<h2 id="org1c8bc03"><span class="section-number-2">46</span> inner(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-46">
<p>
Returns the inner product of vectors, matrices, and tensors. Also known as the matrix product.
</p>

<pre class="example">
A = ((a,b),(c,d))
B = (x,y)
inner(A,B)

┌           ┐
│ a x + b y │
│           │
│ c x + d y │
└           ┘
</pre>

<p>
Note: inner and dot are the same function.
</p>
</div>
</div>

<div id="outline-container-org4060106" class="outline-2">
<h2 id="org4060106"><span class="section-number-2">47</span> integral(f,x)</h2>
<div class="outline-text-2" id="text-47">
<p>
Returns the integral of f with respect to x.
</p>

<pre class="example">
integral(x^2,x)

 1   3
╶─╴ x 
 3    
</pre>
</div>
</div>

<div id="outline-container-org149c3a9" class="outline-2">
<h2 id="org149c3a9"><span class="section-number-2">48</span> inv(m)</h2>
<div class="outline-text-2" id="text-48">
<p>
Returns the inverse of matrix m.
</p>

<pre class="example">
A = ((1,2),(3,4))
inv(A)

┌            ┐
│ −2     1   │
│            │
│  3      1  │
│ ╶─╴   −╶─╴ │
│  2      2  │
└            ┘
</pre>
</div>
</div>

<div id="outline-container-org32a2c02" class="outline-2">
<h2 id="org32a2c02"><span class="section-number-2">49</span> j</h2>
<div class="outline-text-2" id="text-49">
<p>
Set j=sqrt(-1) to use j for the imaginary unit instead of i.
</p>

<pre class="example">
j = sqrt(-1)
1/sqrt(-1)
-j
</pre>
</div>
</div>

<div id="outline-container-orgd6cbabb" class="outline-2">
<h2 id="orgd6cbabb"><span class="section-number-2">50</span> kronecker(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-50">
<p>
Returns the Kronecker product of vectors and matrices.
</p>

<pre class="example">
A = ((1,2),(3,4))
B = ((a,b),(c,d))
kronecker(A,B)
┌                       ┐
│  a     b    2 a   2 b │
│                       │
│  c     d    2 c   2 d │
│                       │
│ 3 a   3 b   4 a   4 b │
│                       │
│ 3 c   3 d   4 c   4 d │
└                       ┘
</pre>
</div>
</div>

<div id="outline-container-org66caff3" class="outline-2">
<h2 id="org66caff3"><span class="section-number-2">51</span> last</h2>
<div class="outline-text-2" id="text-51">
<p>
The result of the previous calculation is stored in last.
</p>

<pre class="example">
212^17
3529471145760275132301897342055866171392
last^(1/17)
212
</pre>

<p>
Note: Symbol last is an implied argument when a function has no argument list.
</p>

<pre class="example">
212^17
3529471145760275132301897342055866171392
float
          39
3.52947 10
</pre>
</div>
</div>

<div id="outline-container-orgffbb231" class="outline-2">
<h2 id="orgffbb231"><span class="section-number-2">52</span> log(x)</h2>
<div class="outline-text-2" id="text-52">
<p>
Returns the natural logarithm of x.
</p>

<pre class="example">
log(x^y)
y log(x)
</pre>
</div>
</div>

<div id="outline-container-orgc796c2d" class="outline-2">
<h2 id="orgc796c2d"><span class="section-number-2">53</span> mag(z)</h2>
<div class="outline-text-2" id="text-53">
<p>
Returns the magnitude of complex z.
</p>

<pre class="example">
mag(x + i y)

┌       ┐1/2
│ 2    2│   
│x  + y │   
│       │   
└       ┘   
</pre>
</div>
</div>

<div id="outline-container-org035e7f9" class="outline-2">
<h2 id="org035e7f9"><span class="section-number-2">54</span> minor(m,i,j)</h2>
<div class="outline-text-2" id="text-54">
<p>
Returns the minor of matrix m for row i and column j.
</p>

<pre class="example">
A = ((1,2,3),(4,5,6),(7,8,9))
minor(A,1,1) == det(minormatrix(A,1,1))
1
</pre>
</div>
</div>

<div id="outline-container-orge0c0fbe" class="outline-2">
<h2 id="orge0c0fbe"><span class="section-number-2">55</span> minormatrix(m,i,j)</h2>
<div class="outline-text-2" id="text-55">
<p>
Returns a copy of matrix m with row i and column j removed.
</p>

<pre class="example">
A = ((1,2,3),(4,5,6),(7,8,9))
minormatrix(A,1,1)

┌       ┐
│ 5   6 │
│       │
│ 8   9 │
└       ┘
</pre>
</div>
</div>


<div id="outline-container-orgf14a2bc" class="outline-2">
<h2 id="orgf14a2bc"><span class="section-number-2">56</span> mod(a,b)</h2>
<div class="outline-text-2" id="text-56">
<p>
Returns the remainder of a over b.
</p>

<pre class="example">
mod(5,3/8)
 1 
╶─╴
 8 
</pre>
</div>
</div>

<div id="outline-container-org1b395b1" class="outline-2">
<h2 id="org1b395b1"><span class="section-number-2">57</span> noexpand(x)</h2>
<div class="outline-text-2" id="text-57">
<p>
Evaluates expression x without expanding products of sums.
</p>

<pre class="example">
noexpand((x + 1)^2 / (x + 1))
x + 1
</pre>
</div>
</div>

<div id="outline-container-orgb80137d" class="outline-2">
<h2 id="orgb80137d"><span class="section-number-2">58</span> not(x)</h2>
<div class="outline-text-2" id="text-58">
<p>
Returns 0 if x is true (nonzero). Returns 1 otherwise.
</p>

<pre class="example">
not(1=1)
0
</pre>
</div>
</div>

<div id="outline-container-org73a4a6b" class="outline-2">
<h2 id="org73a4a6b"><span class="section-number-2">59</span> numerator(x)</h2>
<div class="outline-text-2" id="text-59">
<p>
Returns the numerator of expression x.
</p>

<pre class="example">
numerator(a/b)
a
</pre>
</div>
</div>

<div id="outline-container-org55559e1" class="outline-2">
<h2 id="org55559e1"><span class="section-number-2">60</span> or(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-60">
<p>
Returns 1 if at least one argument is true (nonzero). Returns 0 otherwise.
</p>

<pre class="example">
or(1=1,2=2)
1
</pre>
</div>
</div>

<div id="outline-container-org59b1166" class="outline-2">
<h2 id="org59b1166"><span class="section-number-2">61</span> outer(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-61">
<p>
Returns the outer product of vectors, matrices, and tensors.
</p>

<pre class="example">
A = (a,b,c)
B = (x,y,z)
outer(A,B)
┌                 ┐
│ a x   a y   a z │
│                 │
│ b x   b y   b z │
│                 │
│ c x   c y   c z │
└                 ┘
</pre>
</div>
</div>

<div id="outline-container-orgba5040e" class="outline-2">
<h2 id="orgba5040e"><span class="section-number-2">62</span> pi</h2>
<div class="outline-text-2" id="text-62">
<p>
Symbol for π.
</p>

<pre class="example">
exp(i pi)
-1
</pre>
</div>
</div>

<div id="outline-container-org4b737ca" class="outline-2">
<h2 id="org4b737ca"><span class="section-number-2">63</span> polar(z)</h2>
<div class="outline-text-2" id="text-63">
<p>
Returns complex z in polar form.
</p>

<pre class="example">
polar(x - i y)

┌       ┐1/2                    
│ 2    2│                       
│x  + y │    exp(i arctan(−y,x))
│       │                       
└       ┘                       
</pre>
</div>
</div>

<div id="outline-container-orgeebfc51" class="outline-2">
<h2 id="orgeebfc51"><span class="section-number-2">64</span> power</h2>
<div class="outline-text-2" id="text-64">
<p>
Use ^ to raise something to a power. Use parentheses for negative powers.
</p>

<pre class="example">
x^(-1/2)

  1   
╶────╴
  1/2 
 x    
</pre>
</div>
</div>

<div id="outline-container-org4ccbef6" class="outline-2">
<h2 id="org4ccbef6"><span class="section-number-2">65</span> print(a,b,&#x2026;)</h2>
<div class="outline-text-2" id="text-65">
<p>
Evaluate expressions and print the results. Useful for printing from inside a for loop.
</p>

<pre class="example">
for(j,1,3,print(j))
j = 1
j = 2
j = 3
</pre>
</div>
</div>

<div id="outline-container-org5ec440f" class="outline-2">
<h2 id="org5ec440f"><span class="section-number-2">66</span> product(i,j,k,f)</h2>
<div class="outline-text-2" id="text-66">
<p>
For i equals j through k evaluate f. Returns the product of all f.
</p>

<pre class="example">
product(j,1,3,x + j)

 3      2
x  + 6 x  + 11 x + 6
</pre>

<p>
The original value of i is restored after product completes. If symbol i is used for index variable i then the imaginary unit is overridden in the scope of product.
</p>
</div>
</div>

<div id="outline-container-orgc463032" class="outline-2">
<h2 id="orgc463032"><span class="section-number-2">67</span> product(y)</h2>
<div class="outline-text-2" id="text-67">
<p>
Returns the product of components of y.
</p>

<pre class="example">
product((1,2,3,4))
24
</pre>
</div>
</div>

<div id="outline-container-org81307f6" class="outline-2">
<h2 id="org81307f6"><span class="section-number-2">68</span> quote(x)</h2>
<div class="outline-text-2" id="text-68">
<p>
Returns expression x without evaluating it first.
</p>

<pre class="example">
quote((x + 1)^2)
       2
(x + 1)
</pre>
</div>
</div>

<div id="outline-container-org189b5f5" class="outline-2">
<h2 id="org189b5f5"><span class="section-number-2">69</span> rank(a)</h2>
<div class="outline-text-2" id="text-69">
<p>
Returns the number of indices that tensor a has.
</p>

<pre class="example">
A = ((a,b),(c,d))
rank(A)
2
</pre>
</div>
</div>

<div id="outline-container-org9025860" class="outline-2">
<h2 id="org9025860"><span class="section-number-2">70</span> rationalize(x)</h2>
<div class="outline-text-2" id="text-70">
<p>
Returns expression x with everything over a common denominator.
</p>

<pre class="example">
rationalize(1/a + 1/b + 1/2)

 2 a + a b + 2 b 
╶───────────────╴
      2 a b      
</pre>

<p>
Note: rationalize returns an unexpanded expression. If the result is assigned to a symbol, evaluating the symbol will expand the result. Use binding to retrieve the unexpanded expression.
</p>

<pre class="example">
f = rationalize(1/a + 1/b + 1/2)
binding(f)

 2 a + a b + 2 b 
╶───────────────╴
      2 a b      
</pre>
</div>
</div>

<div id="outline-container-org7f13e9d" class="outline-2">
<h2 id="org7f13e9d"><span class="section-number-2">71</span> real(z)</h2>
<div class="outline-text-2" id="text-71">
<p>
Returns the real part of complex z.
</p>

<pre class="example">
real(2 - 3i)
2
</pre>
</div>
</div>

<div id="outline-container-orgdc27b82" class="outline-2">
<h2 id="orgdc27b82"><span class="section-number-2">72</span> rect(z)</h2>
<div class="outline-text-2" id="text-72">
<p>
Returns complex z in rectangular form.
</p>

<pre class="example">
rect(exp(i x))
cos(x) + i sin(x)
</pre>
</div>
</div>
