resources/documents/manual.org
* rotate(u,s,k,...)

Rotates vector u and returns the result. Vector u is required to have 2n elements where n is an integer from 1 to 15. Arguments s,k,... are a sequence of rotation codes where s is an upper case letter and k is a qubit number 0 to n − 1. Rotations are evaluated from left to right. The available rotations are

| C, k    | Control prefix                                |
| H, k    | Hadamard                                      |
| P, k, φ | Phase modifier (use φ = 1/4 π for T rotation) |
| Q, k    | Quantum Fourier transform                     |
| V, k    | Inverse quantum Fourier transform             |
| W, k, j | Swap qubits                                   |
| X, k    | Pauli X                                       |
| Y, k    | Pauli Y                                       |
| Z, k    | Pauli Z                                       |

Control prefix C, k modifies the next rotation code so that it is a controlled rotation with k as the control qubit. Use two or more prefixes to specify multiple control qubits. For example, C, k, C, j, X, m is a Toffoli rotation. Fourier rotations Q, k and V, k are applied to qubits 0 through k. (Q and V ignore any control prefix.) See also section 3 of the Eigenmath manual.

#+BEGIN_SRC 
psi = (1,0,0,0)
rotate(psi,H,0)

┌        ┐
│   1    │
│ ╶────╴ │
│   1/2  │
│  2     │
│        │
│   1    │
│ ╶────╴ │
│   1/2  │
│  2     │
│        │
│   0    │
│        │
│   0    │
└        ┘
#+END_SRC

* simplify(x)

Returns expression x in a simpler form.

#+BEGIN_SRC 
simplify(sin(x)^2 + cos(x)^2)
1
#+END_SRC

* sin(x)

Returns the sine of x.

#+BEGIN_SRC 
sin(pi/4)

  1   
╶────╴
  1/2 
 2    
#+END_SRC

* sinh(x)

Returns the hyperbolic sine of x.

#+BEGIN_SRC 
circexp(sinh(x))

  1             1        
−╶─╴ exp(−x) + ╶─╴ exp(x)
  2             2        
#+END_SRC

* sqrt(x)

Returns the square root of x.

#+BEGIN_SRC 
sqrt(10!)

     1/2
720 7
#+END_SRC

* stop

In a script, it does what it says.

* sum(i,j,k,f)

For i equals j through k evaluate f. Returns the sum of all f.

#+BEGIN_SRC 
sum(j,1,5,x^j)

 5    4    3    2
x  + x  + x  + x  + x
#+END_SRC

The original value of i is restored after sum completes. If symbol i is used for index variable i then the imaginary unit is overridden in the scope of sum.

* sum(y)

Returns the sum of components of y.

#+BEGIN_SRC 
sum((1,2,3,4))
10
#+END_SRC

* tan(x)

Returns the tangent of x.

* tanh(x)

Returns the hyperbolic tangent of x.

#+BEGIN_SRC 
circexp(tanh(x))

       1             exp(2 x)   
−╶────────────╴ + ╶────────────╴
  exp(2 x) + 1     exp(2 x) + 1 
#+END_SRC

* test(a,b,c,d,...)

If argument a is true (nonzero) then b is returned, else if c is true then d is returned, etc. If the number of arguments is odd then the final argument is returned if all else fails. Expressions can include the relational operators =, ==, <, <=, >, >=. Use the not function to test for inequality. (The equality operator == is available for contexts in which = is the assignment operator.)

#+BEGIN_SRC 
A = 1
B = 1
test(A=B,"yes","no")
yes
#+END_SRC

* trace

Set trace=1 in a script to print the script as it is evaluated. Useful for debugging.

#+BEGIN_SRC 
trace = 1
#+END_SRC

Note: The contract function is used to obtain the trace of a matrix.

* transpose(a,i,j)

Returns the transpose of tensor a with respect to indices i and j. If i and j are omitted then 1 and 2 are used. Hence a matrix can be transposed with a single argument.

#+BEGIN_SRC 
A = ((a,b),(c,d))
transpose(A)

┌       ┐
│ a   c │
│       │
│ b   d │
└       ┘
#+END_SRC

Note: The argument list can be extended for multiple transpose operations. The arguments are evaluated from left to right. For example, transpose(A,1,2,2,3) is equivalent to transpose(transpose(A,1,2),2,3).

* unit(n)
Returns an n by n identity matrix.

#+BEGIN_SRC 
unit(3)

┌           ┐
│ 1   0   0 │
│           │
│ 0   1   0 │
│           │
│ 0   0   1 │
└           ┘
#+END_SRC

* zero(i,j,...)
Returns a null tensor with dimensions i, j, etc. Useful for creating a tensor and then setting the component values.

#+BEGIN_SRC 
A = zero(3,3)
for(k,1,3,A[k,k]=k)
A
    ┌           ┐
    │ 1   0   0 │
    │           │
A = │ 0   2   0 │
    │           │
    │ 0   0   3 │
    └           ┘
#+END_SRC
