resources/documents/manual.html

<div id="outline-container-org73ef6f2" class="outline-2">
<h2 id="org73ef6f2"><span class="section-number-2">73</span> rotate(u,s,k,&#x2026;)</h2>
<div class="outline-text-2" id="text-73">
<p>
Rotates vector u and returns the result. Vector u is required to have 2n elements where n is an integer from 1 to 15. Arguments s,k,&#x2026; are a sequence of rotation codes where s is an upper case letter and k is a qubit number 0 to n − 1. Rotations are evaluated from left to right. The available rotations are
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C, k</td>
<td class="org-left">Control prefix</td>
</tr>

<tr>
<td class="org-left">H, k</td>
<td class="org-left">Hadamard</td>
</tr>

<tr>
<td class="org-left">P, k, φ</td>
<td class="org-left">Phase modifier (use φ = 1/4 π for T rotation)</td>
</tr>

<tr>
<td class="org-left">Q, k</td>
<td class="org-left">Quantum Fourier transform</td>
</tr>

<tr>
<td class="org-left">V, k</td>
<td class="org-left">Inverse quantum Fourier transform</td>
</tr>

<tr>
<td class="org-left">W, k, j</td>
<td class="org-left">Swap qubits</td>
</tr>

<tr>
<td class="org-left">X, k</td>
<td class="org-left">Pauli X</td>
</tr>

<tr>
<td class="org-left">Y, k</td>
<td class="org-left">Pauli Y</td>
</tr>

<tr>
<td class="org-left">Z, k</td>
<td class="org-left">Pauli Z</td>
</tr>
</tbody>
</table>

<p>
Control prefix C, k modifies the next rotation code so that it is a controlled rotation with k as the control qubit. Use two or more prefixes to specify multiple control qubits. For example, C, k, C, j, X, m is a Toffoli rotation. Fourier rotations Q, k and V, k are applied to qubits 0 through k. (Q and V ignore any control prefix.) See also section 3 of the Eigenmath manual.
</p>

<pre class="example">
psi = (1,0,0,0)
rotate(psi,H,0)

┌        ┐
│   1    │
│ ╶────╴ │
│   1/2  │
│  2     │
│        │
│   1    │
│ ╶────╴ │
│   1/2  │
│  2     │
│        │
│   0    │
│        │
│   0    │
└        ┘
</pre>
</div>
</div>

<div id="outline-container-orgfc190b9" class="outline-2">
<h2 id="orgfc190b9"><span class="section-number-2">74</span> simplify(x)</h2>
<div class="outline-text-2" id="text-74">
<p>
Returns expression x in a simpler form.
</p>

<pre class="example">
simplify(sin(x)^2 + cos(x)^2)
1
</pre>
</div>
</div>

<div id="outline-container-org0b6d73c" class="outline-2">
<h2 id="org0b6d73c"><span class="section-number-2">75</span> sin(x)</h2>
<div class="outline-text-2" id="text-75">
<p>
Returns the sine of x.
</p>

<pre class="example">
sin(pi/4)

  1   
╶────╴
  1/2 
 2    
</pre>
</div>
</div>

<div id="outline-container-org3d166e0" class="outline-2">
<h2 id="org3d166e0"><span class="section-number-2">76</span> sinh(x)</h2>
<div class="outline-text-2" id="text-76">
<p>
Returns the hyperbolic sine of x.
</p>

<pre class="example">
circexp(sinh(x))

  1             1        
−╶─╴ exp(−x) + ╶─╴ exp(x)
  2             2        
</pre>
</div>
</div>

<div id="outline-container-org7939c99" class="outline-2">
<h2 id="org7939c99"><span class="section-number-2">77</span> sqrt(x)</h2>
<div class="outline-text-2" id="text-77">
<p>
Returns the square root of x.
</p>

<pre class="example">
sqrt(10!)

     1/2
720 7
</pre>
</div>
</div>

<div id="outline-container-orgff2ece9" class="outline-2">
<h2 id="orgff2ece9"><span class="section-number-2">78</span> stop</h2>
<div class="outline-text-2" id="text-78">
<p>
In a script, it does what it says.
</p>
</div>
</div>

<div id="outline-container-org055654d" class="outline-2">
<h2 id="org055654d"><span class="section-number-2">79</span> sum(i,j,k,f)</h2>
<div class="outline-text-2" id="text-79">
<p>
For i equals j through k evaluate f. Returns the sum of all f.
</p>

<pre class="example">
sum(j,1,5,x^j)

 5    4    3    2
x  + x  + x  + x  + x
</pre>

<p>
The original value of i is restored after sum completes. If symbol i is used for index variable i then the imaginary unit is overridden in the scope of sum.
</p>
</div>
</div>

<div id="outline-container-orgeb4a426" class="outline-2">
<h2 id="orgeb4a426"><span class="section-number-2">80</span> sum(y)</h2>
<div class="outline-text-2" id="text-80">
<p>
Returns the sum of components of y.
</p>

<pre class="example">
sum((1,2,3,4))
10
</pre>
</div>
</div>

<div id="outline-container-orge713a70" class="outline-2">
<h2 id="orge713a70"><span class="section-number-2">81</span> tan(x)</h2>
<div class="outline-text-2" id="text-81">
<p>
Returns the tangent of x.
</p>
</div>
</div>

<div id="outline-container-orge173206" class="outline-2">
<h2 id="orge173206"><span class="section-number-2">82</span> tanh(x)</h2>
<div class="outline-text-2" id="text-82">
<p>
Returns the hyperbolic tangent of x.
</p>

<pre class="example">
circexp(tanh(x))

       1             exp(2 x)   
−╶────────────╴ + ╶────────────╴
  exp(2 x) + 1     exp(2 x) + 1 
</pre>
</div>
</div>

<div id="outline-container-orga979e5f" class="outline-2">
<h2 id="orga979e5f"><span class="section-number-2">83</span> test(a,b,c,d,&#x2026;)</h2>
<div class="outline-text-2" id="text-83">
<p>
If argument a is true (nonzero) then b is returned, else if c is true then d is returned, etc. If the number of arguments is odd then the final argument is returned if all else fails. Expressions can include the relational operators <code>, =</code>, &lt;, &lt;=, &gt;, &gt;=. Use the not function to test for inequality. (The equality operator == is available for contexts in which = is the assignment operator.)
</p>

<pre class="example">
A = 1
B = 1
test(A=B,"yes","no")
yes
</pre>
</div>
</div>

<div id="outline-container-orga8407b8" class="outline-2">
<h2 id="orga8407b8"><span class="section-number-2">84</span> trace</h2>
<div class="outline-text-2" id="text-84">
<p>
Set trace=1 in a script to print the script as it is evaluated. Useful for debugging.
</p>

<pre class="example">
trace = 1
</pre>

<p>
Note: The contract function is used to obtain the trace of a matrix.
</p>
</div>
</div>

<div id="outline-container-org666733f" class="outline-2">
<h2 id="org666733f"><span class="section-number-2">85</span> transpose(a,i,j)</h2>
<div class="outline-text-2" id="text-85">
<p>
Returns the transpose of tensor a with respect to indices i and j. If i and j are omitted then 1 and 2 are used. Hence a matrix can be transposed with a single argument.
</p>

<pre class="example">
A = ((a,b),(c,d))
transpose(A)

┌       ┐
│ a   c │
│       │
│ b   d │
└       ┘
</pre>

<p>
Note: The argument list can be extended for multiple transpose operations. The arguments are evaluated from left to right. For example, transpose(A,1,2,2,3) is equivalent to transpose(transpose(A,1,2),2,3).
</p>
</div>
</div>

<div id="outline-container-org09a7d8b" class="outline-2">
<h2 id="org09a7d8b"><span class="section-number-2">86</span> unit(n)</h2>
<div class="outline-text-2" id="text-86">
<p>
Returns an n by n identity matrix.
</p>

<pre class="example">
unit(3)

┌           ┐
│ 1   0   0 │
│           │
│ 0   1   0 │
│           │
│ 0   0   1 │
└           ┘
</pre>
</div>
</div>

<div id="outline-container-org79411b5" class="outline-2">
<h2 id="org79411b5"><span class="section-number-2">87</span> zero(i,j,&#x2026;)</h2>
<div class="outline-text-2" id="text-87">
<p>
Returns a null tensor with dimensions i, j, etc. Useful for creating a tensor and then setting the component values.
</p>

<pre class="example">
A = zero(3,3)
for(k,1,3,A[k,k]=k)
A
    ┌           ┐
    │ 1   0   0 │
    │           │
A = │ 0   2   0 │
    │           │
    │ 0   0   3 │
    └           ┘
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Galindo</p>
<p class="date">Created: 2022-01-07 vie 13:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
